Revit 2026 API

# WorksharingUtilsCheckoutElements(Document, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> CheckoutElements(
	Document document,
	ICollection<ElementId> elementsToCheckout
)
```
```vb
Public Shared Function CheckoutElements (
	document As Document,
	elementsToCheckout As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ CheckoutElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToCheckout
)
```
```fsharp
static member CheckoutElements :
        document : Document *
        elementsToCheckout : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

document Document

elementsToCheckout ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

WorksharingUtils Class

CheckoutElements Overload

Autodesk.Revit.DB Namespace